 
/*
UML - Диаграммы
UML exempl - Для чтения
UML anote - Видео обзор основных понятий



UML - Диаграммы Делятся на 3 КАЕГОРИИ
1. Поведенческая 
use case - Диаграмма прецендентов
aсtivity - Диаграмма поведеия 
Seguense - Диаграмма Последовательности
(Она описывает конкреетный случай, Она не предусматривает условий.) Тоесть ставим одно за одним без условий!!!!
Создается по каждому преценденту и по каждому варианту !!!!

2. Структурная (Сушествует 4 вида диаграмм)
Диаграмма классов
Диаграмма объектов
Диаграмма коммуникаций

3. Общая структура и общее взаимодействие. -(Как элементы оисания поведения как и элементы основных черт)
14 - основных типов диаграмм(Прождект менеджмент)

Диаграмма компонентов - Показывает и структуру и способ взаимодействия.

Рассмотрим use case Диаграмма прецендентов

Пример:
     крышечка
Как ее можем использовать?
закрывать провода
шайба
стаканчик
шайба
Задачи которые мы хотим использовать нашь предмет "КРЫШЕЧКА" называются прецендентом (Пишутся в овале)
 Акторы - это самостоятельно инициируют систему к действию(Это активно действующий элемент но не управляет этой системой)
 Пример: Актор - это человек(пользуется системой) Кот (с автоматической кормушкой) Актор может не живое существо(Что самостоятельно вызывает действие в системе)
 Пример: Актора (Датчик) - при считывании он вызывает действие.


 Программы для составления диаграмм
 ------------------
 creately
 diagrams.net - безплатная - и нормальный стандарт.
------------------
 figma - для создания для дизайнерской сруктуры (Для выб разработки иверстальщик и дизайнер) (Безплатная)
 starume - 
 uml - designer -  Хорошо делает uml  Поддерживает Джава
 ____________________________
 rational rose - Программа 
 rational designer - Для проектирования диаграмм


 Seguense - Диаграмма Последовательности
 ПРИМЕР НА ДИАГРАММЕ: Приемка товара
 Продавец - Имеет БЛОК АКТИВАЦИИ

*/